/*
  String_ui.strings
  iina

  Created by lhc on 3/1/2017.
  Copyright © 2017 lhc. All rights reserved.
*/
// Common

"general.on" = "켜기";
"general.off" = "끄기";
"general.login" = "로그인";
"general.logout" = "로그아웃";
"general.ok" = "승인";
"general.cancel" = "취소";
"general.username" = "사용자";
"general.password" = "암호";
"general.na" = "N/A";

"input.value_is_empty" = "값을 비워둘 수 없습니다.";
"input.already_exists" = "값이 이미 존재합니다.";

// Guide Window
"guide.highlights" = "새로 추가된 기능";
"guide.basic_settings" = "일반 설정";
"guide.faq" = "자주 묻는 질문";

// Initial Window
"initial.announcement" = "%@ 버전을 사용하고 있습니다.";
"initial.beta.desc" = "정식 버전으로 롤백하려면, 환경 설정 > 일반 탭에서 \"베타 업데이트 받기\"를 해제하고, <a href=\"https://iina.io\"> 공식 웹사이트</a>에서 정식 버전을 설치하세요.";
"initial.nightly.desc" = "나이틀리 빌드는 일반적으로 사용하지 않는 것을 추천합니다. 나이틀리 빌드는 자동 업데이트를 지원하지 않습니다. <a href=\"https://nightly.iina.io\">나이틀리 웹사이트</a>에서 최신 빌드를 수동으로 다운로드하세요.";
"initial.debug.desc" = "디버그 빌드는 성능에 최적화되어 있지 않으므로, 일반적으로 사용하지 않는 것이 좋습니다. 디버그 빌드는 자동 업데이트를 지원하지 않습니다.";
"initial.bug_report" = "<a href=\"https://github.com/iina/iina/issues\">GitHub 이슈</a>를 통해 오류를 보고해주십시오.";

// Inspector Window
"inspector.error" = "오류";

// MainWindowController.swift
"main.buffering_indicator" = "버퍼링… %d%%";
"main.opening_stream" = "스트림 여는 중…";
"main.seeking_indicator" = "찾는 중…";
"osc.precision" = "정밀도";
"osc.1s" = "1초";
"osc.100ms" = "100밀리초";
"osc.10ms" = "10밀리초";
"osc.1ms" = "1밀리초";

// QuickSettingViewController.swift
"quicksetting.item_default" = "기본값";
"quicksetting.item_none" = "없음";
"quicksetting.hwdec" = "하드웨어 디코딩";
"quicksetting.deinterlace" = "디인터레이스";
"quicksetting.hdr" = "HDR";
"quicksetting.hide" = "숨기기";
"quicksetting.reset_speed" = "기본 속도로 되돌리기";

// EQ Presets
"eq.preset.flat" = "플랫";
"eq.preset.acoustic" = "어쿠스틱";
"eq.preset.classical" = "클래식";
"eq.preset.dance" = "댄스";
"eq.preset.deep" = "딥";
"eq.preset.electronic" = "일렉트로닉";
"eq.preset.hip_hop" = "힙합";
"eq.preset.increase_bass" = "베이스 증가";
"eq.preset.increase_treble" = "트레블 증가";
"eq.preset.increase_vocal" = "보컬 증가";
"eq.preset.jazz" = "재즈";
"eq.preset.latin" = "라틴";
"eq.preset.loundness" = "큰 소리";
"eq.preset.lounge" = "라운지";
"eq.preset.piano" = "피아노";
"eq.preset.pop" = "팝";
"eq.preset.rnb" = "R&B";
"eq.preset.reduce_bass" = "베이스 감소";
"eq.preset.reduce_treble" = "트레블 감소";
"eq.preset.rock" = "록";
"eq.preset.small_speaker" = "소형 스피커";
"eq.preset.spoken_word" = "음성";

"alert.eq.new_profile.title" = "새 EQ 프로필";
"alert.eq.new_profile.message" = "프로필의 이름을 입력해주세요.";
"alert.eq.rename.title" = "현재 프로필 이름 변경";
"alert.eq.rename.message" = "새 프로필의 이름을 입력해주세요.";

// OSDMessage.swift
"osd.pause" = "일시 정지됨";
"osd.resume" = "재생 복원됨";
"osd.volume" = "음량: %@";
"osd.speed" = "속도: %@배속";
"osd.aspect" = "화면비: %@";
"osd.crop" = "화면 자르기: %@";
"osd.rotate" = "회전: %i°";
"osd.deinterlace" = "디인터레이스: %@";
"osd.hwdec" = "하드웨어 디코딩: %@";
"osd.audio_delay.nodelay" = "오디오 지연: 없음";
"osd.audio_delay.later" = "오디오 지연: %@초 느리게";
"osd.audio_delay.earlier" = "오디오 지연: %@초 빠르게";
"osd.sub_delay.nodelay" = "자막 지연: 없음";
"osd.sub_delay.later" = "자막 지연: %@초 느리게";
"osd.sub_delay.earlier" = "자막 지연: %@초 빠르게";
"osd.subtitle_pos" = "자막 위치: %@";
"osd.sub_hidden" = "자막 숨김";
"osd.sub_visible" = "자막 보임";
"osd.sub_second_delay.nodelay" = "두번째 자막 지연: 없음";
"osd.sub_second_delay.later" = "두번째 자막 지연: %@초 느리게";
"osd.sub_second_delay.earlier" = "두번째 자막 지연: %@초 빠르게";
"osd.sub_second_hidden" = "두번째 자막 숨김";
"osd.sub_second_pos" = "두번째 자막 위치: %@";
"osd.sub_second_visible" = "두번째 자막 보임";
"osd.mute" = "소리 끔";
"osd.unmute" = "음소거 해제";
"osd.screenshot" = "스크린샷 저장됨";
"osd.abloop.a" = "구간 반복: 시작 위치";
"osd.abloop.b" = "구간 반복: 마침 위치";
"osd.abloop.clear" = "구간 반복: 해제됨";
"osd.stop" = "정지됨";
"osd.chapter" = "챕터: %@";
"osd.subtitle_scale" = "자막 크기: %@배";
"osd.add_to_playlist" = "%i 파일이 재생목록에 추가되었습니다";
"osd.clear_playlist" = "재생목록 비움";
"osd.video_eq.contrast" = "대비: %i";
"osd.video_eq.gamma" = "감마: %i";
"osd.video_eq.hue" = "색조: %i";
"osd.video_eq.saturation" = "채도: %i";
"osd.video_eq.brightness" = "밝기: %i";
"osd.find_online_sub" = "인터넷에서 자막을 찾는 중…";
"osd.find_online_sub.source" = "사이트에서 찾는 중";
"osd.sub_not_found" = "자막을 찾지 못했습니다";
"osd.sub_found" = "%d개의 자막 찾음";
"osd.sub_downloading" = "%d 자막 다운로드 중";
"osd.sub_downloaded" = "자막 다운로드됨";
"osd.sub_saved" = "자막 저장됨";
"osd.network_error" = "네트워크 오류";
"osd.file_error" = "파일 읽기 오류";
"osd.cannot_login" = "로그인할 수 없음";
"osd.canceled" = "취소됨";
"osd.cannot_connect" = "연결할 수 없음";
"osd.timed_out" = "시간 초과됨";
"osd.filter_added" = "필터 추가됨: %@";
"osd.filter_removed" = "필터 제거됨";
"osd.file_loop" = "단일 파일 반복 재생";
"osd.playlist_loop" = "재생목록 반복 재생";
"osd.no_loop" = "반복 재생하지 않음";

"preference.title" = "환경설정";
"preference.general" = "일반";
"preference.ui" = "화면";
"preference.video_audio" = "비디오/오디오";
"preference.subtitle" = "자막";
"preference.network" = "네트워크";
"preference.control" = "제어";
"preference.keybindings" = "단축키";
"preference.advanced" = "고급설정";
"preference.plugins" = "플러그인";
"preference.utilities" = "유틸리티";
"preference.scripts" = "스크립트";
"preference.not_logged_in" = "로그인되지 않음";
"preference.logged_in_as" = "%@(으)로 로그인됨";
"preference.system_media_control" = "시스템 미디어 컨트롤 사용";

"preference.key_binding_hint_1" = "현재 설정 파일의 단축키 설정을 편집하려면, 먼저 \"복제…\" 버튼을 눌러 복사본을 만든 후 변경하십시오.";
"preference.key_binding_hint_2" = "해당 단축키를 편집하려면 오른쪽 단축키 내용을 더블클릭 하십시오.";

"preference.enable_adv_settings" = "고급 설정 사용";

"preference.sub_override_level.no" = "아니요";
"preference.sub_override_level.force" = "force";
"preference.sub_override_level.scale" = "크기";
"preference.sub_override_level.strip" = "strip";
"preference.sub_override_level.yes" = "yes";

"preference.sub_override_level.descriptive_text.no" = "자막 스크립트가 명시한 대로 자막 표시, 덮어쓰지 않음.";
"preference.sub_override_level.descriptive_text.force" = "전체 자막 스타일 적용.";
"preference.sub_override_level.descriptive_text.scale" = "이 섹션의 스타일 설정 및 크기 설정 적용.";
"preference.sub_override_level.descriptive_text.strip" = "자막의 모든 ASS 태그와 스타일 완전히 제거.";
"preference.sub_override_level.descriptive_text.yes" = "이 섹션의 모든 스타일 설정 적용.";

"preference.ytdl_plugin_not_installed" = "\"플러그인 > GitHub에서 설치\"에서 온라인 미디어 플러그인을 설치하면 비디오 다운로드 및 자동 Yt-Dlp 업데이트와 같은 고급 기능을 사용할 수 있습니다.";
"preference.ytdl_plugin_installed" = "온라인 미디어 플러그인이 설치되어 있어 내장된 youtube-dl 지원이 비활성화되어 있습니다.";

"menu.volume" = "음량: %@";
"menu.volume_muted" = "음량: %@ (음소거 됨)";
"menu.audio_delay" = "오디오 지연: %@초";
"menu.sub_delay" = "자막 지연: %@초";
"menu.sub_hide" = "자막 숨기기";
"menu.sub_show" = "자막 보이기";
"menu.sub_second_hide" = "두번째 자막 숨기기";
"menu.sub_second_show" = "두번째 자막 보이기";
"menu.fullscreen" = "전체 화면";
"menu.exit_fullscreen" = "전체 화면에서 나가기";
"menu.pip" = "화면 속 화면";
"menu.exit_pip" = "화면 속 화면에서 나가기";
"menu.mini_player" = "음악 모드 전환";
"menu.exit_mini_player" = "음악 모드 나가기";
"menu.pause" = "일시 정지";
"menu.resume" = "재생";
"menu.speed" = "속도: %@배속";
"menu.chapters" = "챕터 목록 보기";
"menu.hide_chapters" = "챕터 패널 숨기기";
"menu.playlist" = "재생목록 보기";
"menu.hide_playlist" = "재생목록 패널 숨기기";
"menu.video" = "비디오 패널 보기";
"menu.hide_video" = "비디오 패널 숨기기";
"menu.audio" = "오디오 패널 보기";
"menu.hide_audio" = "오디오 패널 숨기기";
"menu.subtitles" = "자막 패널 보기";
"menu.hide_subtitles" = "자막 패널 숨기기";

"menu.seek_forward" = "앞으로 탐색 %@초";
"menu.seek_backward" = "뒤로 탐색 %@초";
"menu.speed_up" = "%@배 빠르게 재생";
"menu.speed_down" = "%@배 느리게 재생";
"menu.volume_up" = "음량 +%@%%";
"menu.volume_down" = "음량 -%@%%";
"menu.audio_delay_up" = "오디오 지연 +%@초";
"menu.audio_delay_down" = "오디오 지연 -%@초";
"menu.sub_delay_up" = "자막 지연 +%@초";
"menu.sub_delay_down" = "자막 지연 -%@초";

"menu.crop_custom" = "사용자 설정…";
"menu.find_online_sub" = "%@에서 온라인 자막 찾기";

"menu.manage_plugins" = "플러그인 관리…";
"menu.developer_tool" = "개발자 툴";
"menu.more_plugin" = "더보기…";
"menu.conflicting_shortcuts" = "충돌하는 단축키…";
"menu.reload_plugins" = "모든 플러그인 새로고침";
"menu.show_plugins_panel" = "플러그인 패널 표시";
"menu.hide_plugins_panel" = "플러그인 패널 숨기기";

"track.audio" = "오디오";
"track.none" = "<없음>";
"track.sub" = "자막";
"track.video" = "비디오";

"subtrack.no_loaded" = "자막을 불러올 수 없습니다";
"subtrack.no_external" = "외부 자막을 찾을 수 없습니다";

// Alerts
"alert.beta_channel.title" = "베타 버전 받기";

"alert.title_error" = "오류";
"alert.title_warning" = "주의";
"alert.title_info" = "정보";

"alert.fatal_error" = "심각한 오류: %@ \n프로그램이 지금 종료됩니다.";
"alert.mpv_error" = "%@ (%@)오류가 사용자 지정 옵션 %@을 설정하는 도중 발생했습니다.";

"alert.unsupported_audio" = "지원되지 않는 외부 오디오 파일입니다.";
"alert.unsupported_video" = "지원되지 않는 외부 동영상 파일입니다.";
"alert.unsupported_sub" = "지원되지 않는 자막 형식입니다.";
"alert.unsupported_url" = "지원되지 않는 URL입니다.";
"alert.wrong_url_format" = "잘못된 URL 형식입니다.";

"alert.error_open" = "파일 또는 스트림을 열 수 없습니다!";
"alert.error_finding_file" = "%@ 파일을 찾을 수 없습니다!";
"alert.error_loading_script" = "%@ 스크립트를 불러올 수 없습니다!";
"alert.error_saving_file" = "%@: %@을 저장하는 도중 오류가 발생했습니다.";
"alert.error_deleting_file" = "파일을 삭제할 수 없습니다.";

"alert.target_peak.bad_value" = "값 \"%@\"는 올바르지 않습니다.\n10에서 10000 사이의 값 또는 0을 입력해 주세요.";

"alert.config.new.title" = "새 설정 파일";
"alert.config.new.message" = "새 설정 파일의 이름을 입력하십시오.";
"alert.config.duplicate.title" = "설정 파일 복제";
"alert.config.duplicate.message" = "새로 만들 설정 파일의 이름을 입력하십시오.";
"alert.config.file_existing.title" = "같은 이름의 설정 파일이 이미 있습니다.";
"alert.config.file_existing.message" = "같은 이름의 설정 파일이 이미 존재합니다. Finder에서 파일을 보려면 OK를 선택하세요.";
"alert.config.cannot_create" = "설정 파일을 만들 수 없습니다!\n%@";
"alert.config.cannot_write" = "설정 파일에 저장할 수 없습니다!";
"alert.config.rename.title" = "설정 파일 이름 변경하기";
"alert.config.rename.message" = "새 설정 파일의 이름을 입력해주세요.";

"alert.filter.incorrect" = "필터를 설정하는 도중 오류가 발생했습니다. 매개변수 형식을 확인하십시오.";
"alert.add_filter.title" = "새 필터";
"alert.add_filter.message" = "mpv 플레이어의 vf 또는 af 명령의 형식으로 필터 설정 문자열을 입력하십시오.";

"alert.keybinding_config.error" = "단축키 설정 파일 \"%@\"를 읽어올 때 오류가 발생했습니다! IINA 기본값을 사용하도록 설정됩니다. 사용자가 지정한 단축키 설정 내용을 점검하십시오.";

"alert.extra_option.cannot_read" = "사용자가 지정한 mpv 추가 옵션을 읽을 수 없습니다.";
"alert.extra_option.empty" = "항목과 그 설정값을 반드시 지정해야 합니다!";
"alert.extra_option.error" = "--%@=%@ 설정에서 %d 오류가 발생했습니다. 환경설정 > 고급설정으로 이동하여 사용자가 지정한 추가 설정 사항을 점검하십시오.";
"alert.extra_option.config_folder" = "\"%@\"를 설정 디렉토리로 지정하는 도중 오류가 발생했습니다.";

"alert.playlist.error_deleting" = "삭제 오류: %@";

"alert.screenshot.error_taking" = "스크린샷을 찍을 수 없습니다!";

"alert.sub.no_selected" = "다운로드된 자막을 선택하십시오.";
"alert.sub_lang_not_set" = "OpenSubtitles를 사용하기 전에 자막의 선호 언어를 설정하십시오. 지금은 영어(eng)를 사용합니다.";
"alert.sub.cannot_save_passwd" = "키체인에 암호를 저장할 수 없습니다: %@";
"alert.sub.cannot_login" = "로그인할 수 없습니다. 계정 이름과 암호, 네트워크 상태를 확인하십시오.\n\n%@";
"alert.sub.save_downloaded.title" = "다운로드된 자막 저장";

"alert.set_default.title" = "IINA를 기본 프로그램으로 설정";
"alert.set_default.message" = "지원하는 모든 파일 유형에 대해 IINA를 기본 프로그램으로 설정합니다.";
"alert.set_default.success" = "설정을 마쳤습니다: %d개 성공, %d개 실패";

"alert.add_watch.title" = "상태 보기 항목 추가";
"alert.add_watch.message" = "올바른 mpv 속성명을 입력하십시오.";

"alert.jump_to.title" = "위치로 가기";
"alert.jump_to.message" = "재생할 위치의 시간을 입력하십시오. 예: 20:35";

"alert.opensub.login.title" = "OpenSubtitles 로그인";
"alert.opensub.login.message" = "사용자 계정과 암호를 입력하십시오.";

"alert.open_url.title" = "URL 열기";
"alert.open_url.message" = "URL을 입력하십시오";
"alert.choose_media_file.title" = "재생할 파일 선택";

"alert.add_url.title" = "URL 추가";
"alert.add_url.message" = "URL을 입력하십시오";

"alert.delete_history.title" = "최근에 재생한 기록 삭제";
"alert.delete_history.message" = "선택한 재생 기록을 삭제하시겠습니까?";

"alert.filter_hwdec.message" = "사용자 비디오 필터를 적용합니다. 그러나 현재 사용 중인 하드웨어 디코더가 비디오 필터를 제대로 지원하지 않을 수도 있습니다. 사용자 필터를 사용하지 않도록 설정하거나, 두 배의 메모리를 사용하는 자동(복사) 방식으로 전환하여 사용할 수 있습니다.\n이전에 설정했던 작업(예를 들어 화면 자르기 설정)이 동작하게 하려면 다시 설정해야 하는 경우도 있습니다.";
"alert.filter_hwdec.abort" = "중단";
"alert.filter_hwdec.turn_off" = "하드웨어 디코딩 끄기";
"alert.filter_hwdec.use_copy" = "자동(복사)로 전환";

"alert.clear_cache.title" = "썸네일 캐시 비우기";
"alert.clear_cache.message" = "썸네일 캐시를 전부 비우겠습니까?";

"alert.clear_history.title" = "재생 기록 지우기";
"alert.clear_history.message" = "재생 기록을 지우겠습니까？";

"alert.clear_watch_later.title" = "이어보기 목록 지우기";
"alert.clear_watch_later.message" = "\"watch later\"폴더에 저장된 이어보기 목록을 지우겠습니까?";

"alert.restore_alerts.title" = "비활성화된 알림 복구하기";
"alert.restore_alerts.message" = "비활성화된 모든 알림을 다시 활성화 하시겠습니까?";

"alert.nothing_to_open" = "열 수 있는 파일이 없습니다.";

"alert.no_video_track" = "비디오 트랙이 없습니다.";

"alert.duplicate_config" = "기본 설정은 수정할 수 없습니다.\n설정을 복제한 다음 수정하십시오.";

"alert.assrt_register" = "API 사용량 제한이 있으므로, 사용자가 개별 API 토큰을 만들어 사용하는 것이 좋습니다. 기본 제공되는 토큰은 기능 시연용이므로 네트워크 오류가 발생할 수 있습니다.";
"alert.assrt_register.register" = "지금 등록하기";
"alert.assrt_register.try" = "사용해 보기";
"alert.assrt_token_prompt.title" = "API 토큰을 입력하십시오";
"alert.assrt_token_prompt.message" = "열린 웹페이지에서 등록해 주십시오. 홈페이지의 사용자 설정에서 토큰을 발급받아 아래에 입력하십시오:";
"alert.assrt_token_invalid" = "Assrt API 토큰을 잘못 입력한 것 같습니다.";

"alert.plugin_uninstall.title" = "%@을(를) 삭제 하시겠습니까?";
"alert.plugin_uninstall.message" = "이 플러그인이 디스크에서 삭제됩니다.";
"alert.plugin_reinstall.title" = "%@ 플러그인이 이미 존재합니다.";
"alert.plugin_reinstall.message" = "플러그인을 재설치하시겠습니까?";
"alert.duplicated_plugin_id" = "중복된 플러그인 식별자가 감지되었습니다. 두 개 이상의 플러그인 식별자 \"%@\"가 동일합니다. 이로 인해 비정상적인 동작이 발생할 수 있습니다. 환경설정 - 플러그인에서 해당 플러그인을 찾아 해당 플러그인 작성자에게 신고하세요. 플러그인이 로컬에 설치된 경우 플러그인의 Info.json 파일에서 식별자를 수동으로 변경할 수도 있습니다.";
"alert.plugin_no_update" = "업데이트가 없습니다.";
"alert.plugin_update_found.title" = "%@의 업데이트를 찾음";
"alert.plugin_update_found.message" = "최신 버전은 %@입니다. %@에서 업데이트 하시겠습니까?";
"alert.plugin_permission" = "이 플러그인은 다음과 같은 권한을 필요로 합니다. 진행하기 전에 확인해 주세요.";
"alert.plugin_permission_added" = "이 업데이트는 추가적인 승인이 필요합니다. 진행하기 전에 다시 한번 읽어주세요.";

"playlist.total_length" = "전체 %@";
"playlist.total_length_with_selected" = "%@ 선택됨 / 전체 %@";
"playlist.sorting.header" = "정렬";
"playlist.sorting.filename_ascending" = "이름 오름차순";
"playlist.sorting.filename_descending" = "이름 내림차순";
"playlist.sorting.path_ascending" = "파일 경로 오름차순";
"playlist.sorting.path_descending" = "파일 경로 내림차순";
"pl_menu.title_multi" = "%d개의 항목";
"pl_menu.play_next" = "다음 항목 재생";
"pl_menu.play_in_new_window" = "새 윈도우에서 재생";
"pl_menu.remove" = "제거";
"pl_menu.remove_multi" = "선택 항목 제거";
"pl_menu.delete" = "휴지통에 버리기";
"pl_menu.delete_multi" = "선택한 파일을 휴지통에 버리기";
"pl_menu.delete_after_play" = "재생 후 휴지통에 버리기";
"pl_menu.delete_after_play_multi" = "선택항목 재생 후 휴지통에 버리기";
"pl_menu.show_in_finder" = "Finder에서 보기";
"pl_menu.add_file" = "파일 추가…";
"pl_menu.add_url" = "URL 추가…";
"pl_menu.clear_playlist" = "재생목록 지움";
"pl_menu.matched_sub" = "%d개의 자막 일치";
"pl_menu.add_sub" = "자막 추가…";
"pl_menu.wrong_sub" = "잘못된 자막!";
"pl_menu.browser" = "브라우저에서 열기";
"pl_menu.copy_url" = "URL 복사";
"pl_menu.copy_url_multi" = "여러 URL 복사";

"keymapping.title" = "단축키 지정";
"keymapping.message" = "단축키로 사용할 키를 누르십시오.";

"filter.video_filters" = "비디오 필터";
"filter.audio_filters" = "오디오 필터";

"hwdec.no" = "하드웨어 디코딩을 사용하지 않습니다.";
"hwdec.auto" = "하드웨어 디코딩을 사용합니다.\n비디오 필터 대부분을 사용할 수 없게 됩니다.";
"hwdec.auto-copy" = "하드웨어 디코딩을 사용합니다.\n두 배의 메모리를 사용하지만, 비디오 필터를 적용할 수 있습니다.";

"gaplessAudio.no" = "오디오 파일을 연속 재생하면 파일이 바뀔 때 소리가 나지 않거나 끊길 수 있습니다.";
"gaplessAudio.weak" = "디코더가 출력하는 오디오 형식이 바뀌면, 오디오 장치가 재시작되므로 끊김 없는 재생을 방해할 수 있습니다.";
"gaplessAudio.yes" = "처음 재생한 파일의 형식으로 오디오 장치를 실행하고 끊김 없는 재생을 위해 계속 켜진 채로 유지합니다. 이후 파일은 리샘플링될 수 있습니다.";

"subencoding.auto" = "자동 감지";

"osc_toolbar.settings" = "빠른 설정";
"osc_toolbar.playlist" = "재생목록 및 챕터";
"osc_toolbar.pip" = "화면 속 화면 전환/복귀";
"osc_toolbar.full_screen" = "전체 화면 전환/복귀";
"osc_toolbar.music_mode" = "음악 모드 전환";
"osc_toolbar.sub_track" = "자막 선택";
"osc_toolbar.screenshot" = "스크린샷 찍기";
"osc_toolbar.plugins" = "플러그인 패널 보기";

"mini_player.album_art" = "앨범 아트 켜기/끄기";
"mini_player.loop" = "반복";
"mini_player.shuffle" = "무작위 재생";
"mini_player.remove" = "재생 목록에서 제거";
"mini_player.add" = "재생 목록에 추가";
"mini_player.delete" = "재생 목록에서 모든 트랙 제거";
"mini_player.volume" = "음량";
"mini_player.close" = "음악 모드 닫기";
"mini_player.back" = "비디오 모드로 복귀";
"mini_player.sort" = "플레이리스트 정렬";

// Touch bar

"touchbar.ahead_15" = "15초 후";
"touchbar.ahead_30" = "30초 후";
"touchbar.back_15" = "15초 전";
"touchbar.back_30" = "30초 전";
"touchbar.next_video" = "다음 영상";
"touchbar.prev_video" = "이전 영상";
"touchbar.increase_volume" = "음량 +";
"touchbar.decrease_volume" = "음량 -";
"touchbar.rewind" = "되감기";
"touchbar.fast_forward" = "빨리 감기";
"touchbar.play_pause" = "재생 / 일시 정지";
"touchbar.seek" = "탐색";
"touchbar.time" = "재생 위치";
"touchbar.remainingTimeOrTotalDuration" = "남은 시간 / 총 지속시간";
"touchbar.toggle_pip" = "화면 속 화면 전환/복귀";

// Plugin permissions

"permissions.network-request.name" = "네트워크 요청";
"permissions.network-request.desc" = "이 플러그인은 아래 웹사이트에 요청을 보내거나 데이터를 업로드할 수 있습니다:";
"permissions.network-request.any_site" = "모든 사이트";
"permissions.show-osd.name" = "OSD 보기";
"permissions.show-osd.desc" = "이 플러그인은 화면에 OSD가 표시될 수 있습니다";
"permissions.show-alert.name" = "경고 표시";
"permissions.show-alert.desc" = "이 플러그인은 경고창이 뜰 수 있습니다.";
"permissions.video-overlay.name" = "비디오에 오버레이 추가";
"permissions.video-overlay.desc" = "이 플러그인은 화면에 다른 콘텐츠를 표시할 수 있습니다.";
"permissions.file-system.name" = "파일 시스템에 접근합니다.";
"permissions.file-system.desc" = "이 플러그인은 민감한 정보를 포함하여 디스크의 파일을 읽거나 쓸 수 있습니다. 또한 컴퓨터에 해를 끼칠 수 있는 다른 프로그램이나 애플리케이션을 호출할 수도 있습니다. 따라서 출처를 반드시 확인하세요.";

"plugin.install" = "설치";
"plugin.installed" = "설치됨";
"plugin.not_installed" = "설치되지 않음";
"plugin.local" = "로컬에 설치되었습니다";
"alert.plugin.install_error" = "설치 중 오류발생: %@";
"alert.invalid_url" = "URL이 유효하지 않습니다.";
"plugin.install_error.invalid_url" = "URL이 유효하지 않습니다.";
"plugin.install_error.file_not_found" = "패키지 파일을 찾을 수 없습니다.";
"plugin.install_error.cannot_download" = "플러그인 다운로드에 실패했습니다.\n\n출력: %@\n";
"plugin.install_error.cannot_unpackage" = "플러그인 설치에 실패했습니다.\n\n출력: %@\n";
"plugin.install_error.cannot_load" = "IINA가 이 플러그인을 로드할 수 없습니다. 플러그인이 잘못된 형식일 수 있습니다.";
"plugin.check_for_updates" = "업데이트 확인";
"plugin.updating" = "업데이트 다운로드 중...";
